# Python3 (3.4.3)
import sys
input = sys.stdin.readline

# -------------------------------------------------------------
# function
# -------------------------------------------------------------


# -------------------------------------------------------------
# main
# -------------------------------------------------------------
H, W, K = map(int, input().split())

mod = 10**9 + 7

# 左(あるいは右)にn本の縦棒があり、真横と繋がっている時の場合の数
j = [0, 1, 1, 2, 3, 5, 8, 13]
# 左(あるいは右)にn本の縦棒があり、真横と繋がっていない時の場合の数
m = [1, 1, 2, 3, 5, 8, 13, 21]

# dp[h][w] : h行目を終えた時点でwにいる場合の数
dp = [[0 for _ in range(W)] for _ in range(H + 1)]
dp[0][0] = 1

for h in range(H + 1):
    for w in range(W):
        # 右に移動
        if w != 0:
            dp[h][w] += dp[h - 1][w - 1] * j[w] * m[W - 1 - w]
        # 左に移動
        if w != W - 1:
            dp[h][w] += dp[h - 1][w + 1] * m[w] * j[W - 1 - w]
        # 真下に移動
        dp[h][w] += dp[h - 1][w] * m[w] * m[W - 1 - w]

        dp[h][w] %= mod


print(dp[H][K - 1])
